In [27]:
import pandas as pd

In [28]:
df = pd.read_csv("EU_schedule.csv")

In [29]:
df.head()

  schedule unit geo        date   value
0  N_SCHED   NR  AL  2019-01-01    28.0
1  N_SCHED   NR  AT  2019-01-01  2028.0
2  N_SCHED   NR  BA  2019-01-01    76.0
3  N_SCHED   NR  BE  2019-01-01  1520.0
4  N_SCHED   NR  BG  2019-01-01   453.0

In [30]:
df.shape

(34632, 5)

In [31]:
df.isnull().sum()

schedule       0
unit           0
geo            0
date           0
value       3654
dtype: int64

In [32]:
df.tail()

      schedule       unit geo        date  value
34627    TOTAL  PCH_SM_19  SE  2025-02-01  -31.5
34628    TOTAL  PCH_SM_19  SI  2025-02-01   -8.9
34629    TOTAL  PCH_SM_19  SK  2025-02-01  -12.3
34630    TOTAL  PCH_SM_19  TR  2025-02-01   12.0
34631    TOTAL  PCH_SM_19  UK  2025-02-01   -5.2

In [33]:
df["value"].describe()

count     30978.000000
mean       7307.421661
std       39608.463763
min         -99.300000
25%          -9.400000
50%          10.200000
75%         427.900000
max      702675.000000
Name: value, dtype: float64

In [34]:
df[df["value"] < 0]

      schedule       unit geo        date  value
509    N_SCHED     PCH_M1  BA  2019-02-01  -10.5
510    N_SCHED     PCH_M1  BE  2019-02-01  -12.0
514    N_SCHED     PCH_M1  CZ  2019-02-01   -2.9
516    N_SCHED     PCH_M1  DK  2019-02-01   -2.2
517    N_SCHED     PCH_M1  EE  2019-02-01   -0.5
...        ...        ...  ..         ...    ...
34625    TOTAL  PCH_SM_19  RO  2025-02-01   -0.8
34627    TOTAL  PCH_SM_19  SE  2025-02-01  -31.5
34628    TOTAL  PCH_SM_19  SI  2025-02-01   -8.9
34629    TOTAL  PCH_SM_19  SK  2025-02-01  -12.3
34631    TOTAL  PCH_SM_19  UK  2025-02-01   -5.2

[11328 rows x 5 columns]

In [35]:
df["value"] = df["value"].interpolate()

In [36]:
df.head()

  schedule unit geo        date   value
0  N_SCHED   NR  AL  2019-01-01    28.0
1  N_SCHED   NR  AT  2019-01-01  2028.0
2  N_SCHED   NR  BA  2019-01-01    76.0
3  N_SCHED   NR  BE  2019-01-01  1520.0
4  N_SCHED   NR  BG  2019-01-01   453.0

In [37]:
df.isnull().sum()

schedule    0
unit        0
geo         0
date        0
value       0
dtype: int64